AchimPieters/esp32-lifecycle-manager/main/github_update.c
/**
   Copyright 2026 Achim Pieters | StudioPieters®

   Permission is hereby granted, free of charge, to any person obtaining a copy
   of this software and associated documentation files (the "Software"), to deal
   in the Software without restriction, including without limitation the rights
   to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
   copies of the Software, and to permit persons to whom the Software is
   furnished to do so, subject to the following conditions:

   The above copyright notice and this permission notice shall be included in all
   copies or substantial portions of the Software.

   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
   IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
   FITNESS FOR A PARTICULAR PURPOSE AND NON INFRINGEMENT. IN NO EVENT SHALL THE
   AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
   WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

   for more information visit https://www.studiopieters.nl
 **/

#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include <time.h>
#include "esp_log.h"
#include "esp_https_ota.h"
#include "esp_http_client.h"
#include "esp_ota_ops.h"
#include "esp_partition.h"
#include "esp_app_desc.h"
#include "esp_crt_bundle.h"
#include "soc/soc_caps.h"
#include "mbedtls/md.h"
#include "mbedtls/pk.h"
#include "esp_image_format.h"
#include "cJSON.h"
#include "nvs_flash.h"
#include "github_update.h"
#include "led_indicator.h"
#include "nvs_keys.h"
#include "nvs_store.h"

static const char *TAG = "github_update";

#ifdef SOC_GPIO_PIN_COUNT
#define LCM_MAX_GPIO_PIN ((int)SOC_GPIO_PIN_COUNT - 1)
#else
#define LCM_MAX_GPIO_PIN 32
#endif

#ifndef ESP_PARTITION_LABEL_MAX_LEN
#define ESP_PARTITION_LABEL_MAX_LEN 16
#endif

#define INSTALLED_VER_MAX_LEN 32
#define OTA_SIG_MAGIC 0x4C434D53UL
#define OTA_SIG_VERSION 1U
#define OTA_SIG_ALGO_ECDSA_P256_SHA256 1U
#define OTA_SIG_MAX_LEN 512U
#define INSTALLED_LABEL_MAX_LEN (ESP_PARTITION_LABEL_MAX_LEN + 1)
#define FACTORY_BOOTSTRAP_VERSION "0.0.0"
typedef enum {
    OTA_STATE_IDLE = 0,
    OTA_STATE_CHECKING_RELEASE,
    OTA_STATE_DOWNLOADING,
    OTA_STATE_VERIFYING,
    OTA_STATE_STAGING,
    OTA_STATE_ACTIVATING,
    OTA_STATE_FAILED,
    OTA_STATE_REBOOTING,
} ota_state_t;

static const char *OTA_REASON_NONE = "none";
static const char *OTA_REASON_RELEASE_API_FAILURE = "release_api_failure";
static const char *OTA_REASON_MISSING_ASSET = "missing_asset";
static const char *OTA_REASON_INVALID_SIGNATURE = "invalid_signature";
static const char *OTA_REASON_INVALID_IMAGE_LENGTH = "invalid_image_length";
static const char *OTA_REASON_PARTITION_UNAVAILABLE = "partition_unavailable";
static const char *OTA_REASON_BOOT_PARTITION_SET_FAILURE = "boot_partition_set_failure";
static const char *OTA_REASON_HTTP_FAILURE = "http_failure";
static const char *OTA_REASON_ROLLBACK_BLOCKED = "rollback_blocked";

static const char *ota_state_to_str(ota_state_t state) {
    switch (state) {
    case OTA_STATE_IDLE: return "IDLE";
    case OTA_STATE_CHECKING_RELEASE: return "CHECKING_RELEASE";
    case OTA_STATE_DOWNLOADING: return "DOWNLOADING";
    case OTA_STATE_VERIFYING: return "VERIFYING";
    case OTA_STATE_STAGING: return "STAGING";
    case OTA_STATE_ACTIVATING: return "ACTIVATING";
    case OTA_STATE_FAILED: return "FAILED";
    case OTA_STATE_REBOOTING: return "REBOOTING";
    default: return "UNKNOWN";
    }
}

static bool ota_state_from_str(const char *state_str, ota_state_t *out_state) {
    if (!state_str || !out_state) {
        return false;
    }
    if (strcmp(state_str, "IDLE") == 0) {
        *out_state = OTA_STATE_IDLE;
        return true;
    }
    if (strcmp(state_str, "CHECKING_RELEASE") == 0) {
        *out_state = OTA_STATE_CHECKING_RELEASE;
        return true;
    }
    if (strcmp(state_str, "DOWNLOADING") == 0) {
        *out_state = OTA_STATE_DOWNLOADING;
        return true;
    }
    if (strcmp(state_str, "VERIFYING") == 0) {
        *out_state = OTA_STATE_VERIFYING;
        return true;
    }
    if (strcmp(state_str, "STAGING") == 0) {
        *out_state = OTA_STATE_STAGING;
        return true;
    }
    if (strcmp(state_str, "ACTIVATING") == 0) {
        *out_state = OTA_STATE_ACTIVATING;
        return true;
    }
    if (strcmp(state_str, "FAILED") == 0) {
        *out_state = OTA_STATE_FAILED;
        return true;
    }
    if (strcmp(state_str, "REBOOTING") == 0) {
        *out_state = OTA_STATE_REBOOTING;
        return true;
    }
    return false;
}

static bool ota_transition_allowed(ota_state_t current, ota_state_t next) {
    switch (current) {
    case OTA_STATE_IDLE:
        return next == OTA_STATE_CHECKING_RELEASE;
    case OTA_STATE_CHECKING_RELEASE:
        return next == OTA_STATE_IDLE || next == OTA_STATE_DOWNLOADING || next == OTA_STATE_FAILED;
    case OTA_STATE_DOWNLOADING:
        return next == OTA_STATE_VERIFYING || next == OTA_STATE_FAILED;
    case OTA_STATE_VERIFYING:
        return next == OTA_STATE_STAGING || next == OTA_STATE_FAILED;
    case OTA_STATE_STAGING:
        return next == OTA_STATE_ACTIVATING || next == OTA_STATE_FAILED;
    case OTA_STATE_ACTIVATING:
        return next == OTA_STATE_REBOOTING || next == OTA_STATE_FAILED;
    case OTA_STATE_FAILED:
        return next == OTA_STATE_CHECKING_RELEASE || next == OTA_STATE_IDLE;
    case OTA_STATE_REBOOTING:
        return false;
    default:
        return false;
    }
}

static esp_err_t ota_persist_state(ota_state_t state, esp_err_t last_error,
                                   const char *repo, const char *last_seen_version,
                                   const char *last_success_version,
                                   const char *failure_reason) {
    nvs_handle_t h;
    esp_err_t err = nvs_store_open_rw(NVS_NS_FWCFG, &h);
    if (err != ESP_OK) {
        return err;
    }

