AchimPieters/esp32-lifecycle-manager/main/github_update.c
    char current_state_str[32];
    size_t current_len = sizeof(current_state_str);
    esp_err_t current_err = nvs_store_get_str(h, NVS_KEY_OTA_STATE, current_state_str, &current_len);
    if (current_err == ESP_OK) {
        ota_state_t current_state = OTA_STATE_IDLE;
        if (ota_state_from_str(current_state_str, &current_state) &&
            !ota_transition_allowed(current_state, state)) {
            ESP_LOGW(TAG, "Rejected invalid OTA transition: %s -> %s",
                     current_state_str, ota_state_to_str(state));
            nvs_store_close(h);
            return ESP_ERR_INVALID_STATE;
        }
    } else if (current_err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(TAG, "Failed to load current OTA state: %s", esp_err_to_name(current_err));
    }

    err = nvs_store_set_str(h, NVS_KEY_OTA_STATE, ota_state_to_str(state));
    if (err == ESP_OK) {
        err = nvs_store_set_i32(h, NVS_KEY_OTA_LAST_ERR, (int32_t)last_error);
    }
    if (err == ESP_OK) {
        err = nvs_store_set_u32(h, NVS_KEY_OTA_LAST_ATTEMPT, (uint32_t)time(NULL));
    }
    if (err == ESP_OK && repo && repo[0] != '\0') {
        err = nvs_store_set_str(h, NVS_KEY_OTA_SOURCE_REPO, repo);
    }
    if (err == ESP_OK && last_seen_version && last_seen_version[0] != '\0') {
        err = nvs_store_set_str(h, NVS_KEY_OTA_LAST_SEEN_VER, last_seen_version);
    }
    if (err == ESP_OK && last_success_version && last_success_version[0] != '\0') {
        err = nvs_store_set_str(h, NVS_KEY_OTA_LAST_OK_VER, last_success_version);
    }
    if (err == ESP_OK && failure_reason && failure_reason[0] != '\0') {
        err = nvs_store_set_str(h, NVS_KEY_OTA_LAST_REASON, failure_reason);
    }
    if (err == ESP_OK) {
        err = nvs_store_commit_and_close(h);
    } else {
        nvs_store_close(h);
    }

    if (err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to persist OTA state %s: %s",
                 ota_state_to_str(state), esp_err_to_name(err));
        return err;
    }

    ESP_LOGI(TAG, "OTA state => %s (err=%s, reason=%s)",
             ota_state_to_str(state), esp_err_to_name(last_error),
             failure_reason ? failure_reason : OTA_REASON_NONE);
    return ESP_OK;
}

static bool parse_version(const char *str, int *maj, int *min, int *pat) {
    *maj = *min = *pat = 0;
    if (!str) {
        ESP_LOGE(TAG, "Version string is null");
        return false;
    }
    if (str[0] == 'v' || str[0] == 'V') str++;
    int parsed = sscanf(str, "%d.%d.%d", maj, min, pat);
    if (parsed < 3) {
        ESP_LOGE(TAG, "Invalid version string: %s", str);
        *maj = *min = *pat = 0;
        return false;
    }
    return true;
}

static int cmp_version(int aMaj, int aMin, int aPat,
                       int bMaj, int bMin, int bPat) {
    if (aMaj != bMaj) return aMaj - bMaj;
    if (aMin != bMin) return aMin - bMin;
    return aPat - bPat;
}

static bool running_from_factory_partition(void) {
    const esp_partition_t *running = esp_ota_get_running_partition();
    return running &&
           running->type == ESP_PARTITION_TYPE_APP &&
           running->subtype == ESP_PARTITION_SUBTYPE_APP_FACTORY;
}

// Anti-rollback floor: the highest firmware version this device has ever
// installed. Releases below the floor are refused so a controlled feed cannot
// push an older, still-validly-signed (and potentially vulnerable) build. Note
// this floor lives in NVS and is therefore cleared by a factory reset; hardware
// anti-rollback (Secure Boot v2 secure_version) is required for a guarantee
// that survives a reset.
static bool load_rollback_floor(int *maj, int *min, int *pat) {
    nvs_handle_t h;
    if (nvs_store_open_ro(NVS_NS_FWCFG, &h) != ESP_OK) {
        return false;
    }
    char buf[INSTALLED_VER_MAX_LEN];
    size_t len = sizeof(buf);
    esp_err_t err = nvs_store_get_str(h, NVS_KEY_OTA_MIN_VER, buf, &len);
    nvs_store_close(h);
    if (err != ESP_OK) {
        return false;
    }
    return parse_version(buf, maj, min, pat);
}

static void raise_rollback_floor(int maj, int min, int pat) {
    int cMaj, cMin, cPat;
    if (load_rollback_floor(&cMaj, &cMin, &cPat) &&
        cmp_version(maj, min, pat, cMaj, cMin, cPat) <= 0) {
        return; // floor is already at least this high
    }
    char buf[INSTALLED_VER_MAX_LEN];
    snprintf(buf, sizeof(buf), "%d.%d.%d", maj, min, pat);
    nvs_handle_t h;
    if (nvs_store_open_rw(NVS_NS_FWCFG, &h) != ESP_OK) {
        return;
    }
    if (nvs_store_set_str(h, NVS_KEY_OTA_MIN_VER, buf) == ESP_OK) {
        (void)nvs_store_commit_and_close(h);
        ESP_LOGI(TAG, "Anti-rollback floor raised to %s", buf);
    } else {
        nvs_store_close(h);
    }
}

static esp_err_t store_installed_version_if_needed(const char *version,
                                                   const char *partition_label) {
    if (version == NULL || version[0] == '\0') {
        return ESP_ERR_INVALID_ARG;
    }

    char truncated[INSTALLED_VER_MAX_LEN];
    strlcpy(truncated, version, sizeof(truncated));

    nvs_handle_t handle;
    esp_err_t err = nvs_store_open_rw(NVS_NS_FWCFG, &handle);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "open_rw(fwcfg) failed when storing version: %s", esp_err_to_name(err));
        return err;
    }

    bool version_changed = false;
    bool label_changed = false;

    char existing[INSTALLED_VER_MAX_LEN];
    size_t existing_len = sizeof(existing);
    esp_err_t get_err = nvs_store_get_str(handle, NVS_KEY_INSTALLED_VER, existing, &existing_len);
    if (get_err == ESP_OK) {
        if (strcmp(existing, truncated) != 0) {
            err = nvs_store_set_str(handle, NVS_KEY_INSTALLED_VER, truncated);
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "set_str(installed_ver) failed: %s", esp_err_to_name(err));
                nvs_store_close(handle);
                return err;
            }
            version_changed = true;
        }
    } else {
        if (get_err != ESP_ERR_NVS_NOT_FOUND) {
            ESP_LOGW(TAG, "get_str(installed_ver) failed: %s", esp_err_to_name(get_err));
        }
        err = nvs_store_set_str(handle, NVS_KEY_INSTALLED_VER, truncated);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "set_str(installed_ver) failed: %s", esp_err_to_name(err));
            nvs_store_close(handle);
            return err;
        }
        version_changed = true;
    }

