AchimPieters/esp32-lifecycle-manager/main/github_update.c
    if (partition_label && partition_label[0] != '\0') {
        char existing_label[INSTALLED_LABEL_MAX_LEN];
        size_t label_len = sizeof(existing_label);
        esp_err_t label_err = nvs_store_get_str(handle, NVS_KEY_INSTALLED_PART, existing_label, &label_len);
        if (label_err == ESP_OK) {
            if (strcmp(existing_label, partition_label) != 0) {
                err = nvs_store_set_str(handle, NVS_KEY_INSTALLED_PART, partition_label);
                if (err != ESP_OK) {
                    ESP_LOGW(TAG, "set_str(%s) failed: %s", NVS_KEY_INSTALLED_PART, esp_err_to_name(err));
                    nvs_store_close(handle);
                    return err;
                }
                label_changed = true;
            }
        } else {
            if (label_err != ESP_ERR_NVS_NOT_FOUND) {
                ESP_LOGW(TAG, "get_str(%s) failed: %s", NVS_KEY_INSTALLED_PART, esp_err_to_name(label_err));
            }
            err = nvs_store_set_str(handle, NVS_KEY_INSTALLED_PART, partition_label);
            if (err != ESP_OK) {
                ESP_LOGW(TAG, "set_str(%s) failed: %s", NVS_KEY_INSTALLED_PART, esp_err_to_name(err));
                nvs_store_close(handle);
                return err;
            }
            label_changed = true;
        }
    }

    if (version_changed || label_changed) {
        err = nvs_store_commit_and_close(handle);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "commit(installed metadata) failed: %s", esp_err_to_name(err));
            return err;
        }
        if (label_changed && partition_label && partition_label[0] != '\0') {
            ESP_LOGI(TAG, "Stored installed firmware version %s on partition %s",
                     truncated, partition_label);
        } else {
            ESP_LOGI(TAG, "Stored installed firmware version %s", truncated);
        }
    } else {
        ESP_LOGD(TAG, "Installed firmware metadata unchanged");
    }

    nvs_store_close(handle);
    return ESP_OK;
}

static bool load_installed_version(char *version, size_t version_len) {
    if (version == NULL || version_len == 0) {
        return false;
    }

    nvs_handle_t handle;
    esp_err_t err = nvs_store_open_ro(NVS_NS_FWCFG, &handle);
    if (err != ESP_OK) {
        ESP_LOGD(TAG, "Unable to open fwcfg namespace for installed version: %s",
                 esp_err_to_name(err));
        return false;
    }

    size_t required = version_len;
    err = nvs_store_get_str(handle, NVS_KEY_INSTALLED_VER, version, &required);
    nvs_store_close(handle);
    if (err == ESP_OK) {
        return true;
    }

    if (err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(TAG, "get_str(installed_ver) failed: %s", esp_err_to_name(err));
    } else {
        ESP_LOGD(TAG, "Installed firmware version not stored in NVS");
    }
    return false;
}

static bool load_installed_partition_label(char *label, size_t label_len) {
    if (label == NULL || label_len == 0) {
        return false;
    }

    nvs_handle_t handle;
    esp_err_t err = nvs_store_open_ro(NVS_NS_FWCFG, &handle);
    if (err != ESP_OK) {
        ESP_LOGD(TAG, "Unable to open fwcfg namespace for partition label: %s",
                 esp_err_to_name(err));
        return false;
    }

    size_t required = label_len;
    err = nvs_store_get_str(handle, NVS_KEY_INSTALLED_PART, label, &required);
    nvs_store_close(handle);
    if (err == ESP_OK) {
        return true;
    }

    if (err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(TAG, "get_str(%s) failed: %s", NVS_KEY_INSTALLED_PART, esp_err_to_name(err));
    } else {
        ESP_LOGD(TAG, "Installed partition label not stored in NVS");
    }
    return false;
}

static bool read_update_request_flag(void) {
    nvs_handle_t handle;
    esp_err_t err = nvs_store_open_ro(NVS_NS_LCM, &handle);
    if (err != ESP_OK) {
        ESP_LOGD(TAG, "No update request flag present: %s", esp_err_to_name(err));
        return false;
    }

    uint8_t flag = 0;
    err = nvs_store_get_u8(handle, NVS_KEY_DO_UPDATE, &flag);
    nvs_store_close(handle);
    if (err == ESP_OK) {
        return flag != 0;
    }

    if (err != ESP_ERR_NVS_NOT_FOUND) {
        ESP_LOGW(TAG, "nvs_get_u8(do_update) failed: %s", esp_err_to_name(err));
    }
    return false;
}

static esp_err_t write_update_request_flag(bool value) {
    nvs_handle_t handle;
    esp_err_t err = nvs_store_open_rw(NVS_NS_LCM, &handle);
    if (err != ESP_OK) {
        return err;
    }

    uint8_t current = 0;
    esp_err_t get_err = nvs_store_get_u8(handle, NVS_KEY_DO_UPDATE, &current);
    if (get_err == ESP_OK && current == (value ? 1 : 0)) {
        nvs_store_close(handle);
        return ESP_OK;
    }

    err = nvs_store_set_u8(handle, NVS_KEY_DO_UPDATE, value ? 1 : 0);
    if (err != ESP_OK) {
        nvs_store_close(handle);
        return err;
    }

    err = nvs_store_commit_and_close(handle);
    if (err != ESP_OK) {
        return err;
    }

    ESP_LOGD(TAG, "Update request flag set to %d", value ? 1 : 0);
    return ESP_OK;
}

static const esp_partition_t *find_partition_for_version(int maj, int min, int pat) {
    for (esp_partition_subtype_t subtype = ESP_PARTITION_SUBTYPE_APP_OTA_MIN;
         subtype <= ESP_PARTITION_SUBTYPE_APP_OTA_MAX; ++subtype) {
        const esp_partition_t *part = esp_partition_find_first(ESP_PARTITION_TYPE_APP, subtype, NULL);
        if (!part) {
            continue;
        }

        esp_app_desc_t desc;
        esp_err_t desc_err = esp_ota_get_partition_description(part, &desc);
        if (desc_err != ESP_OK) {
            ESP_LOGD(TAG, "Failed to read descriptor for partition %s: %s",
                     part->label, esp_err_to_name(desc_err));
            continue;
        }

        int pMaj, pMin, pPat;
        if (!parse_version(desc.version, &pMaj, &pMin, &pPat)) {
            ESP_LOGD(TAG, "Partition %s has invalid version string '%s'",
                     part->label, desc.version);
            continue;
        }

        if (pMaj == maj && pMin == min && pPat == pat) {
            return part;
        }
    }

