AchimPieters/esp32-lifecycle-manager/main/github_update.c
    return NULL;
}

static esp_err_t set_boot_partition_for_installed_firmware(int maj, int min, int pat,
                                                           const char *version_str,
                                                           bool *partition_changed) {
    const esp_partition_t *target = NULL;
    char label[INSTALLED_LABEL_MAX_LEN];

    if (load_installed_partition_label(label, sizeof(label))) {
        target = esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, label);
        if (!target) {
            ESP_LOGW(TAG, "Stored partition label %s not found", label);
        } else if (target->type != ESP_PARTITION_TYPE_APP ||
                   target->subtype < ESP_PARTITION_SUBTYPE_APP_OTA_MIN ||
                   target->subtype > ESP_PARTITION_SUBTYPE_APP_OTA_MAX) {
            ESP_LOGW(TAG, "Stored partition label %s is not an OTA partition", label);
            target = NULL;
        }
    }

    if (!target) {
        target = find_partition_for_version(maj, min, pat);
    }

    if (!target) {
        ESP_LOGE(TAG, "Unable to locate partition for installed firmware version %s",
                 version_str ? version_str : "(unknown)");
        return ESP_ERR_NOT_FOUND;
    }

    const esp_partition_t *current_boot = esp_ota_get_boot_partition();
    if (current_boot && current_boot->address == target->address) {
        ESP_LOGI(TAG, "Boot partition already set to %s; skipping change",
                 target->label);
        if (partition_changed) {
            *partition_changed = false;
        }
        return ESP_OK;
    }

    ESP_LOGI(TAG, "Restoring boot partition to %s at offset 0x%lx", target->label,
             (unsigned long)target->address);
    esp_err_t set_err = esp_ota_set_boot_partition(target);
    if (partition_changed && set_err == ESP_OK) {
        *partition_changed = true;
    }
    return set_err;
}

esp_err_t save_fw_config(const char *repo, bool pre) {
    ESP_LOGD(TAG, "Saving firmware config repo=%s pre=%d", repo ? repo : "(null)", pre);
    nvs_handle_t h;
    esp_err_t err = nvs_store_open_rw(NVS_NS_FWCFG, &h);
    if (err != ESP_OK) {
        return err;
    }

    if ((err = nvs_store_set_str(h, NVS_KEY_FW_REPO, repo ? repo : "")) != ESP_OK) {
        nvs_store_close(h);
        return err;
    }

    if ((err = nvs_store_set_u8(h, NVS_KEY_FW_PRE, pre ? 1 : 0)) != ESP_OK) {
        nvs_store_close(h);
        return err;
    }

    err = nvs_store_commit_and_close(h);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "nvs_commit failed: %s", esp_err_to_name(err));
    } else {
        ESP_LOGD(TAG, "Firmware config saved");
    }
    return err;
}

bool load_fw_config(char *repo, size_t repo_len, bool *pre) {
    ESP_LOGD(TAG, "Loading firmware config");
    nvs_handle_t h;
    esp_err_t err = nvs_store_open_ro(NVS_NS_FWCFG, &h);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "fwcfg namespace not found");
        return false;
    }

    if (repo) {
        size_t len = repo_len;
        err = nvs_store_get_str(h, NVS_KEY_FW_REPO, repo, &len);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "nvs_get_str(repo) failed: %s", esp_err_to_name(err));
            nvs_store_close(h);
            return false;
        }
    }

    uint8_t pre_u8;
    err = nvs_store_get_u8(h, NVS_KEY_FW_PRE, &pre_u8);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "nvs_get_u8(pre) failed: %s", esp_err_to_name(err));
        nvs_store_close(h);
        return false;
    }
    if (pre) *pre = pre_u8 != 0;
    nvs_store_close(h);
    ESP_LOGD(TAG, "Loaded firmware config repo=%s pre=%d", repo ? repo : "(null)", pre ? *pre : pre_u8);
    return true;
}

esp_err_t save_led_config(bool enabled, int gpio, bool active_high) {
    nvs_handle_t h;
    esp_err_t err = nvs_store_open_rw(NVS_NS_FWCFG, &h);
    if (err != ESP_OK) {
        return err;
    }

    if (gpio < 0) {
        gpio = -1;
    } else if (gpio > LCM_MAX_GPIO_PIN) {
        ESP_LOGW(TAG, "LED GPIO %d out of range (max=%d); disabling indicator",
                 gpio, LCM_MAX_GPIO_PIN);
        gpio = -1;
    }

    if ((err = nvs_store_set_u8(h, NVS_KEY_LED_ENABLED, enabled ? 1 : 0)) != ESP_OK) {
        nvs_store_close(h);
        return err;
    }

    if ((err = nvs_store_set_i32(h, NVS_KEY_LED_GPIO, gpio)) != ESP_OK) {
        nvs_store_close(h);
        return err;
    }

    if ((err = nvs_store_set_u8(h, NVS_KEY_LED_LEVEL, active_high ? 1 : 0)) != ESP_OK) {
        nvs_store_close(h);
        return err;
    }

    err = nvs_store_commit_and_close(h);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "nvs_commit failed: %s", esp_err_to_name(err));
    }
    ESP_LOGD(TAG, "Saved LED config enabled=%d gpio=%d active_high=%d", enabled, gpio, active_high);
    return err;
}

bool load_led_config(bool *enabled, int *gpio, bool *active_high) {
    nvs_handle_t h;
    esp_err_t err = nvs_store_open_ro(NVS_NS_FWCFG, &h);
    if (err != ESP_OK) {
        return false;
    }

    uint8_t en;
    int32_t pin;
    uint8_t level = 0;
    err = nvs_store_get_u8(h, NVS_KEY_LED_ENABLED, &en);
    if (err != ESP_OK) {
        nvs_store_close(h);
        return false;
    }
    err = nvs_store_get_i32(h, NVS_KEY_LED_GPIO, &pin);
    if (err != ESP_OK) {
        nvs_store_close(h);
        return false;
    }
    err = nvs_store_get_u8(h, NVS_KEY_LED_LEVEL, &level);
    if (err != ESP_OK) {
        if (err == ESP_ERR_NVS_NOT_FOUND) {
            level = 0;
        } else {
            nvs_store_close(h);
            return false;
        }
    }
    if (pin > LCM_MAX_GPIO_PIN) {
        ESP_LOGW(TAG, "Stored LED GPIO %ld out of range (max=%d); using disabled",
                 (long)pin, LCM_MAX_GPIO_PIN);
        pin = -1;
    }
    if (enabled) *enabled = en != 0;
    if (gpio) *gpio = (int)pin;
    if (active_high) *active_high = level != 0;
    nvs_store_close(h);
    return true;
}

static esp_err_t download_signature(const char *url, uint8_t *buf, size_t buf_len, size_t *out_len) {
    ESP_LOGD(TAG, "Initializing HTTP client for %s", url);
    esp_http_client_config_t cfg = {
        .url = url,
        .crt_bundle_attach = esp_crt_bundle_attach,
        .user_agent = "esp32-ota",
        // GitHub release assets use redirects with extremely long Location headers
        // (currently >5k and sometimes exceeding 8k), so give the HTTP client a
        // generously sized buffer to ensure the Location header fits entirely.
        .buffer_size = 32768,
        .buffer_size_tx = 32768,
    };
    esp_http_client_handle_t client = esp_http_client_init(&cfg);
    if (!client) {
        ESP_LOGE(TAG, "esp_http_client_init failed");
        return ESP_FAIL;
    }
    esp_http_client_set_header(client, "Accept", "application/octet-stream");
    esp_err_t err;
    int redirects = 0;
    while (redirects < 5) {
        char cur_url[512];
        esp_err_t url_err = esp_http_client_get_url(client, cur_url, sizeof(cur_url));
        ESP_LOGD(TAG, "Attempt %d URL: %s", redirects + 1,
                 url_err == ESP_OK ? cur_url : "(null)");
        ESP_LOGD(TAG, "Opening HTTP connection");
        err = esp_http_client_open(client, 0);
        if (err != ESP_OK) {
            ESP_LOGE(TAG, "esp_http_client_open failed: %s", esp_err_to_name(err));
            esp_http_client_cleanup(client);
            return err;
        }
        ESP_LOGD(TAG, "esp_http_client_open -> %s", esp_err_to_name(err));
        int fetch = esp_http_client_fetch_headers(client);
        ESP_LOGD(TAG, "esp_http_client_fetch_headers -> %d", fetch);
        if (fetch < 0) {
            int e = esp_http_client_get_errno(client);
            ESP_LOGE(TAG, "esp_http_client_fetch_headers failed: errno=%d", e);
            esp_http_client_close(client);
            esp_http_client_cleanup(client);
            return ESP_FAIL;
        }
        int status = esp_http_client_get_status_code(client);
        ESP_LOGD(TAG, "HTTP status %d", status);
        if (status == 301 || status == 302 || status == 303 || status == 307 || status == 308) {
            ESP_LOGD(TAG, "Handling HTTP redirect");
            esp_err_t redir = esp_http_client_set_redirection(client);
            if (redir != ESP_OK) {
                ESP_LOGE(TAG, "Failed to set redirection: %s", esp_err_to_name(redir));
                esp_http_client_close(client);
                esp_http_client_cleanup(client);
                return ESP_FAIL;
            }
            if (esp_http_client_get_url(client, cur_url, sizeof(cur_url)) == ESP_OK) {
                ESP_LOGD(TAG, "Following redirect to %s", cur_url);
            }
            esp_http_client_close(client);
            redirects++;
            continue;
        }
        if (status != 200) {
            ESP_LOGE(TAG, "Unexpected HTTP status %d", status);
            esp_http_client_close(client);
            esp_http_client_cleanup(client);
            return ESP_FAIL;
        }
        char *ctype = NULL;
        esp_http_client_get_header(client, "Content-Type", &ctype);
        ESP_LOGD(TAG, "Content-Type: %s", ctype ? ctype : "(none)");
        if (ctype && (strstr(ctype, "text/") || strstr(ctype, "json"))) {
            ESP_LOGE(TAG, "Unexpected content type: %s", ctype);
            esp_http_client_close(client);
            esp_http_client_cleanup(client);
            return ESP_FAIL;
        }
        int r = esp_http_client_read_response(client, (char *)buf, buf_len);
        ESP_LOGD(TAG, "download_signature read %d bytes", r);
        if (r <= 0) {
            int e = esp_http_client_get_errno(client);
            ESP_LOGE(TAG, "Signature download failed: errno=%d", e);
            esp_http_client_close(client);
            esp_http_client_cleanup(client);
            return ESP_FAIL;
        }
        *out_len = r;
        esp_http_client_close(client);
        esp_http_client_cleanup(client);
        return ESP_OK;
    }
    ESP_LOGE(TAG, "Too many redirects");
    esp_http_client_cleanup(client);
    return ESP_FAIL;
}

static esp_err_t partition_sha256(const esp_partition_t *part, uint32_t len, uint8_t *out)
{
    mbedtls_md_context_t ctx;
    const mbedtls_md_info_t *md_info = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
    uint8_t *buf = malloc(4096);
    if (!buf) return ESP_ERR_NO_MEM;
    mbedtls_md_init(&ctx);
    if (md_info == NULL || mbedtls_md_setup(&ctx, md_info, 0) != 0 || mbedtls_md_starts(&ctx) != 0) {
        free(buf);
        mbedtls_md_free(&ctx);
        return ESP_FAIL;
    }

