AchimPieters/esp32-lifecycle-manager/main/github_update.c
    uint32_t offset = 0;
    while (offset < len) {
        uint32_t to_read = len - offset;
        if (to_read > 4096) to_read = 4096;
        esp_err_t r = esp_partition_read(part, offset, buf, to_read);
        if (r != ESP_OK) {
            free(buf);
            mbedtls_md_free(&ctx);
            return r;
        }
        if (mbedtls_md_update(&ctx, buf, to_read) != 0) {
            free(buf);
            mbedtls_md_free(&ctx);
            return ESP_FAIL;
        }
        offset += to_read;
    }

    if (mbedtls_md_finish(&ctx, out) != 0) {
        free(buf);
        mbedtls_md_free(&ctx);
        return ESP_FAIL;
    }
    mbedtls_md_free(&ctx);
    free(buf);
    return ESP_OK;
}

typedef struct __attribute__((packed)) {
    uint32_t magic;
    uint8_t version;
    uint8_t algorithm;
    uint16_t reserved;
    uint32_t firmware_length;
    uint8_t firmware_hash[32];
    uint16_t signature_length;
} ota_sig_header_t;

static const char OTA_DEFAULT_PUBLIC_KEY_PEM[] =
"-----BEGIN PUBLIC KEY-----\n"
"MFkwEwYHKoZIzj0CAQYIKoZIzj0DAQcDQgAED8gOG1QP8TtSknLNBkxXV2I7zCUx\n"
"cB7aCgI/dbedit40iHQXWHfiDfwxskMG1vrIy38vtjpe/mVvSZmTPQ8P8w==\n"
"-----END PUBLIC KEY-----\n";

#if !defined(CONFIG_LCM_USE_CUSTOM_OTA_PUBLIC_KEY) && !defined(CONFIG_LCM_ALLOW_INSECURE_DEMO_KEY)
#error "No OTA signing key configured. The built-in demo key's private key is public (see keys/ota_signing_private.pem), so it provides no authenticity. Set LCM_USE_CUSTOM_OTA_PUBLIC_KEY=y with your own key, or LCM_ALLOW_INSECURE_DEMO_KEY=y to deliberately build with the insecure demo key (never in production)."
#endif

static const char *ota_public_key_pem(void) {
#if CONFIG_LCM_USE_CUSTOM_OTA_PUBLIC_KEY
    if (strlen(CONFIG_LCM_CUSTOM_OTA_PUBLIC_KEY_PEM) > 0) {
        return CONFIG_LCM_CUSTOM_OTA_PUBLIC_KEY_PEM;
    }
#endif
    return OTA_DEFAULT_PUBLIC_KEY_PEM;
}

static esp_err_t verify_signature_blob(const uint8_t *sig_blob, size_t sig_len,
                                       uint32_t image_len, const uint8_t image_hash[32]) {
    if (sig_len < sizeof(ota_sig_header_t)) {
        ESP_LOGE(TAG, "Signature file too short: %u", (unsigned)sig_len);
        return ESP_ERR_INVALID_SIZE;
    }

    const ota_sig_header_t *header = (const ota_sig_header_t *)sig_blob;
    if (header->magic != OTA_SIG_MAGIC) {
        ESP_LOGE(TAG, "Signature magic mismatch: 0x%08lx", (unsigned long)header->magic);
        return ESP_ERR_INVALID_RESPONSE;
    }
    if (header->version != OTA_SIG_VERSION) {
        ESP_LOGE(TAG, "Unsupported signature version: %u", (unsigned)header->version);
        return ESP_ERR_NOT_SUPPORTED;
    }
    if (header->algorithm != OTA_SIG_ALGO_ECDSA_P256_SHA256) {
        ESP_LOGE(TAG, "Unsupported signature algorithm id: %u", (unsigned)header->algorithm);
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (header->firmware_length != image_len) {
        ESP_LOGE(TAG, "Image length mismatch: expected %lu got %lu",
                 (unsigned long)header->firmware_length, (unsigned long)image_len);
        return ESP_ERR_INVALID_SIZE;
    }

    if (memcmp(header->firmware_hash, image_hash, 32) != 0) {
        ESP_LOGE(TAG, "Image hash mismatch");
        return ESP_ERR_INVALID_CRC;
    }

    const size_t expected_total = sizeof(ota_sig_header_t) + header->signature_length;
    if (header->signature_length == 0 || expected_total != sig_len) {
        ESP_LOGE(TAG, "Signature length invalid: %u (total %u)",
                 (unsigned)header->signature_length, (unsigned)sig_len);
        return ESP_ERR_INVALID_SIZE;
    }

    const uint8_t *signature = sig_blob + sizeof(ota_sig_header_t);
    mbedtls_pk_context pk;
    mbedtls_pk_init(&pk);

    int parse_res = mbedtls_pk_parse_public_key(&pk,
            (const unsigned char *)ota_public_key_pem(),
            strlen(ota_public_key_pem()) + 1);
    if (parse_res != 0) {
        ESP_LOGE(TAG, "Public key parse failed: -0x%04x", -parse_res);
        mbedtls_pk_free(&pk);
        return ESP_FAIL;
    }

    int verify_res = mbedtls_pk_verify(&pk, MBEDTLS_MD_SHA256,
                                       image_hash, 32,
                                       signature, header->signature_length);
    mbedtls_pk_free(&pk);

    if (verify_res != 0) {
        ESP_LOGE(TAG, "Signature verification failed: -0x%04x", -verify_res);
        return ESP_ERR_INVALID_CRC;
    }

    ESP_LOGI(TAG, "Cryptographic signature verified");
    return ESP_OK;
}

esp_err_t github_update_from_urls(const char *fw_url, const char *sig_url,
                                  const char *release_version) {
    (void)ota_persist_state(OTA_STATE_DOWNLOADING, ESP_OK, NULL, release_version, NULL, OTA_REASON_NONE);
    ESP_LOGI(TAG, "Downloading signature from %s", sig_url);
    uint8_t sig[OTA_SIG_MAX_LEN];
    size_t sig_len = 0;
    esp_err_t sig_res = download_signature(sig_url, sig, sizeof(sig), &sig_len);
    if (sig_res != ESP_OK) {
        ESP_LOGE(TAG, "Failed to download signature: %s", esp_err_to_name(sig_res));
        return sig_res;
    }
    ESP_LOGI(TAG, "Downloaded signature (%u bytes)", (unsigned)sig_len);

    const esp_partition_t *update_part = esp_ota_get_next_update_partition(NULL);
    if (!update_part) {
        ESP_LOGE(TAG, "No OTA partition available");
        (void)ota_persist_state(OTA_STATE_FAILED, ESP_FAIL, NULL, release_version, NULL, OTA_REASON_PARTITION_UNAVAILABLE);
        return ESP_FAIL;
    }
    ESP_LOGI(TAG, "Using OTA partition at 0x%lx (%lu bytes)",
             (unsigned long)update_part->address, (unsigned long)update_part->size);
    esp_http_client_config_t http_cfg = {
        .url = fw_url,
        .crt_bundle_attach = esp_crt_bundle_attach,
        .user_agent = "esp32-ota",
        // GitHub release assets use redirects with extremely long headers
        // (sometimes over 8 KB), so enlarge the HTTP client buffers to avoid
        // `HTTP_CLIENT: Out of buffer` errors when fetching the image.
        .buffer_size = 32768,
        .buffer_size_tx = 32768,
    };
    esp_https_ota_config_t ota_cfg = {
        .http_config = &http_cfg,
    };
    ESP_LOGI(TAG, "Starting OTA from %s", fw_url);
    bool led_active = false;
    esp_err_t ret = ESP_OK;
    const char *failure_reason = OTA_REASON_HTTP_FAILURE;
    esp_https_ota_handle_t ota_handle = NULL;
    bool ota_open = false;
    led_blinking_start();
    led_active = true;

    // Use the streaming OTA API instead of the one-shot esp_https_ota(). The
    // one-shot helper switches the boot partition itself before returning, which
    // would activate the new image *before* our signature check runs. With
    // begin/perform we only stage the image to flash; the boot-partition switch
    // happens exclusively in esp_https_ota_finish(), which we defer until after
    // the signature has been verified. A failed verification therefore never
    // leaves an unverified image bootable (fail-closed).
    ret = esp_https_ota_begin(&ota_cfg, &ota_handle);
    if (ret != ESP_OK || ota_handle == NULL) {
        ESP_LOGE(TAG, "esp_https_ota_begin failed: %s", esp_err_to_name(ret));
        if (ret == ESP_OK) {
            ret = ESP_FAIL;
        }
        failure_reason = OTA_REASON_HTTP_FAILURE;
        goto cleanup;
    }
    ota_open = true;

    do {
        ret = esp_https_ota_perform(ota_handle);
    } while (ret == ESP_ERR_HTTPS_OTA_IN_PROGRESS);

    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "OTA download failed: %s", esp_err_to_name(ret));
        failure_reason = OTA_REASON_HTTP_FAILURE;
        goto cleanup;
    }
    if (!esp_https_ota_is_complete_data_received(ota_handle)) {
        ESP_LOGE(TAG, "OTA data incomplete");
        ret = ESP_FAIL;
        failure_reason = OTA_REASON_HTTP_FAILURE;
        goto cleanup;
    }
    ESP_LOGI(TAG, "OTA download complete");
    (void)ota_persist_state(OTA_STATE_VERIFYING, ESP_OK, NULL, release_version, NULL, OTA_REASON_NONE);
    esp_partition_pos_t pos = { .offset = update_part->address, .size = update_part->size };
    esp_image_metadata_t meta;
    esp_err_t meta_res = esp_image_get_metadata(&pos, &meta);
    ESP_LOGD(TAG, "esp_image_get_metadata -> %s", esp_err_to_name(meta_res));
    if (meta_res != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get image metadata: %s", esp_err_to_name(meta_res));
        ret = meta_res;
        failure_reason = OTA_REASON_INVALID_IMAGE_LENGTH;
        goto cleanup;
    }
    (void)ota_persist_state(OTA_STATE_STAGING, ESP_OK, NULL, release_version, NULL, OTA_REASON_NONE);
    uint8_t actual[32];
    esp_err_t hash_res = partition_sha256(update_part, meta.image_len, actual);
    ESP_LOGD(TAG, "partition_sha256 -> %s", esp_err_to_name(hash_res));
    if (hash_res != ESP_OK) {
        ESP_LOGE(TAG, "Failed to compute image hash: %s", esp_err_to_name(hash_res));
        ret = hash_res;
        failure_reason = OTA_REASON_INVALID_IMAGE_LENGTH;
        goto cleanup;
    }

