AchimPieters/esp32-lifecycle-manager/main/github_update.c
    ret = verify_signature_blob(sig, sig_len, meta.image_len, actual);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Signature validation failed: %s", esp_err_to_name(ret));
        failure_reason = OTA_REASON_INVALID_SIGNATURE;
        goto cleanup;
    }

    // Signature verified: only now commit the staged image as the boot target.
    ret = esp_https_ota_finish(ota_handle);
    ota_open = false;
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "esp_https_ota_finish failed: %s", esp_err_to_name(ret));
        failure_reason = OTA_REASON_BOOT_PARTITION_SET_FAILURE;
        goto cleanup;
    }
    led_blinking_stop();
    led_active = false;
    const char *version_to_store = release_version;
    if (!version_to_store || version_to_store[0] == '\0') {
        esp_app_desc_t new_desc;
        esp_err_t desc_err = esp_ota_get_partition_description(update_part, &new_desc);
        if (desc_err == ESP_OK) {
            if (new_desc.version[0] != '\0') {
                version_to_store = new_desc.version;
                ESP_LOGD(TAG, "Persisting firmware version from image descriptor: %s",
                         version_to_store);
            } else {
                ESP_LOGW(TAG, "Image descriptor version string is empty; nothing to persist");
            }
        } else {
            ESP_LOGW(TAG, "Failed to read image descriptor for version persistence: %s",
                     esp_err_to_name(desc_err));
        }
    }
    if (version_to_store && version_to_store[0] != '\0') {
        (void)ota_persist_state(OTA_STATE_ACTIVATING, ESP_OK, NULL, release_version, version_to_store, OTA_REASON_NONE);
        esp_err_t store_err = store_installed_version_if_needed(version_to_store,
                                                                update_part->label);
        if (store_err != ESP_OK) {
            ESP_LOGW(TAG, "Failed to persist installed version %s: %s",
                     version_to_store, esp_err_to_name(store_err));
        }
        int vMaj, vMin, vPat;
        if (parse_version(version_to_store, &vMaj, &vMin, &vPat)) {
            raise_rollback_floor(vMaj, vMin, vPat);
        }
    } else {
        ESP_LOGW(TAG, "Skipping persistence of installed version because no value is available");
    }

    ESP_LOGI(TAG, "Signed image verified, rebooting");
    (void)ota_persist_state(OTA_STATE_REBOOTING, ESP_OK, NULL, release_version, version_to_store, OTA_REASON_NONE);
    esp_err_t flag_err = write_update_request_flag(false);
    if (flag_err != ESP_OK) {
        ESP_LOGW(TAG, "Failed to clear update request flag: %s", esp_err_to_name(flag_err));
    }
    esp_restart();
    return ESP_OK;

cleanup:
    // Abort any open OTA session. esp_https_ota_abort() releases the handle
    // without switching the boot partition, so a failed/aborted update keeps the
    // currently running firmware as the boot target.
    if (ota_open && ota_handle) {
        (void)esp_https_ota_abort(ota_handle);
    }
    if (ret != ESP_OK) {
        (void)ota_persist_state(OTA_STATE_FAILED, ret, NULL, release_version, NULL, failure_reason);
    }
    if (led_active) {
        led_blinking_stop();
    }
    return ret;
}

esp_err_t github_update_if_needed(const char *repo, bool prerelease) {
    (void)ota_persist_state(OTA_STATE_CHECKING_RELEASE, ESP_OK, repo, NULL, NULL, OTA_REASON_NONE);
    char api[256];
    snprintf(api, sizeof(api), "https://api.github.com/repos/%s/releases%s", repo,
             prerelease ? "?per_page=5" : "/latest");
    esp_http_client_config_t cfg = { .url = api, .crt_bundle_attach = esp_crt_bundle_attach,
        .user_agent = "esp32-ota" };
    ESP_LOGI(TAG, "Checking updates for repo %s (pre=%d)", repo, prerelease);
    ESP_LOGD(TAG, "Release API URL: %s", api);
    bool update_requested = read_update_request_flag();
    if (update_requested) {
        ESP_LOGI(TAG, "Update request flag detected");
    }

    char installed_version[INSTALLED_VER_MAX_LEN] = {0};
    bool using_stored_version = load_installed_version(installed_version, sizeof(installed_version));
    int curMaj = 0, curMin = 0, curPat = 0;
    bool curValid = false;
    if (using_stored_version) {
        curValid = parse_version(installed_version, &curMaj, &curMin, &curPat);
        if (!curValid) {
            ESP_LOGW(TAG, "Stored installed version '%s' is invalid; ignoring",
                     installed_version);
            installed_version[0] = '\0';
            using_stored_version = false;
        }
    }

    bool running_factory = running_from_factory_partition();
    const esp_app_desc_t *running_desc = esp_app_get_description();
    if (!curValid) {
        if (running_factory) {
            curMaj = 0;
            curMin = 0;
            curPat = 0;
            curValid = true;
            strlcpy(installed_version, FACTORY_BOOTSTRAP_VERSION, sizeof(installed_version));
            ESP_LOGI(TAG,
                     "No installed OTA firmware stored; using factory bootstrap version %s",
                     FACTORY_BOOTSTRAP_VERSION);
        } else {
            curValid = parse_version(running_desc ? running_desc->version : NULL,
                                     &curMaj, &curMin, &curPat);
            if (!curValid) {
                ESP_LOGE(TAG, "Invalid current firmware version, assuming 0.0.0");
            }
        }
    }

    if (curValid) {
        snprintf(installed_version, sizeof(installed_version), "%d.%d.%d",
                 curMaj, curMin, curPat);
    }

    ESP_LOGI(TAG, "Current firmware version %d.%d.%d (%s)", curMaj, curMin, curPat,
             using_stored_version ? "installed" : "factory");
    esp_http_client_handle_t client = esp_http_client_init(&cfg);
    if (!client) {
        ESP_LOGE(TAG, "esp_http_client_init failed");
        (void)ota_persist_state(OTA_STATE_FAILED, ESP_FAIL, repo, NULL, NULL, OTA_REASON_RELEASE_API_FAILURE);
        return ESP_FAIL;
    }
    esp_err_t err = esp_http_client_open(client, 0);
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "esp_http_client_open failed: %s", esp_err_to_name(err));
        esp_http_client_cleanup(client);
        (void)ota_persist_state(OTA_STATE_FAILED, err, repo, NULL, NULL, OTA_REASON_HTTP_FAILURE);
        return err;
    }
    ESP_LOGD(TAG, "esp_http_client_open -> %s", esp_err_to_name(err));
    int len = esp_http_client_fetch_headers(client);
    ESP_LOGD(TAG, "Header length %d", len);
    if (len < 0) {
        ESP_LOGE(TAG, "esp_http_client_fetch_headers failed: errno=%d", esp_http_client_get_errno(client));
        esp_http_client_close(client);
        esp_http_client_cleanup(client);
        (void)ota_persist_state(OTA_STATE_FAILED, ESP_FAIL, repo, NULL, NULL, OTA_REASON_HTTP_FAILURE);
        return ESP_FAIL;
    }
    char *data = malloc(len + 1);
    if (!data) { ESP_LOGE(TAG, "malloc failed"); esp_http_client_close(client); esp_http_client_cleanup(client); (void)ota_persist_state(OTA_STATE_FAILED, ESP_ERR_NO_MEM, repo, NULL, NULL, OTA_REASON_RELEASE_API_FAILURE); return ESP_ERR_NO_MEM; }
    int read = esp_http_client_read_response(client, data, len);
    int status = esp_http_client_get_status_code(client);
    ESP_LOGD(TAG, "Read %d bytes with HTTP status %d", read, status);
    if (read <= 0) {
        ESP_LOGE(TAG, "esp_http_client_read_response failed: errno=%d", esp_http_client_get_errno(client));
        free(data);
        esp_http_client_close(client);
        esp_http_client_cleanup(client);
        (void)ota_persist_state(OTA_STATE_FAILED, ESP_FAIL, repo, NULL, NULL, OTA_REASON_HTTP_FAILURE);
        return ESP_FAIL;
    }
    data[read] = '\0';
    esp_http_client_close(client);
    esp_http_client_cleanup(client);

