AchimPieters/esp32-lifecycle-manager/main/github_update.c
    cJSON *json = cJSON_Parse(data);
    free(data);
    if (!json) { ESP_LOGE(TAG, "cJSON_Parse failed"); (void)ota_persist_state(OTA_STATE_FAILED, ESP_FAIL, repo, NULL, NULL, OTA_REASON_RELEASE_API_FAILURE); return ESP_FAIL; }
    ESP_LOGD(TAG, "Release JSON parsed");

    cJSON *release = NULL;
    if (prerelease) {
        ESP_LOGD(TAG, "Prerelease mode: using first release from list");
        if (!cJSON_IsArray(json)) { cJSON_Delete(json); return ESP_FAIL; }
        release = cJSON_GetArrayItem(json, 0);
    } else {
        if (cJSON_IsArray(json)) {
            ESP_LOGD(TAG, "Array returned, searching for stable release");
            for (int i=0; i<cJSON_GetArraySize(json); ++i) {
                cJSON *rel = cJSON_GetArrayItem(json, i);
                cJSON *pre = cJSON_GetObjectItem(rel, "prerelease");
                if (!cJSON_IsTrue(pre)) { release = rel; break; }
            }
        } else {
            ESP_LOGD(TAG, "Object returned from /latest endpoint");
            release = json;
            cJSON *pre = cJSON_GetObjectItem(release, "prerelease");
            if (cJSON_IsTrue(pre)) release = NULL; // need to fetch list
        }
        if (!release) {
            ESP_LOGW(TAG, "Falling back to full release list");
            cJSON_Delete(json);
            snprintf(api, sizeof(api), "https://api.github.com/repos/%s/releases?per_page=5", repo);
            cfg.url = api;
            client = esp_http_client_init(&cfg);
            if (!client) return ESP_FAIL;
            err = esp_http_client_open(client, 0);
            if (err != ESP_OK) {
                ESP_LOGE(TAG, "esp_http_client_open failed: %s", esp_err_to_name(err));
                esp_http_client_cleanup(client);
                return err;
            }
            ESP_LOGD(TAG, "esp_http_client_open -> %s", esp_err_to_name(err));
            len = esp_http_client_fetch_headers(client);
            ESP_LOGD(TAG, "Header length %d", len);
            if (len < 0) {
                ESP_LOGE(TAG, "esp_http_client_fetch_headers failed: errno=%d", esp_http_client_get_errno(client));
                esp_http_client_close(client);
                esp_http_client_cleanup(client);
                return ESP_FAIL;
            }
            data = malloc(len + 1);
            if (!data) { ESP_LOGE(TAG, "malloc failed"); esp_http_client_close(client); esp_http_client_cleanup(client); return ESP_ERR_NO_MEM; }
            read = esp_http_client_read_response(client, data, len);
            status = esp_http_client_get_status_code(client);
            ESP_LOGD(TAG, "Read %d bytes with HTTP status %d", read, status);
            if (read <= 0) {
                ESP_LOGE(TAG, "esp_http_client_read_response failed: errno=%d", esp_http_client_get_errno(client));
                free(data);
                esp_http_client_close(client);
                esp_http_client_cleanup(client);
                return ESP_FAIL;
            }
            data[read] = '\0';
            esp_http_client_close(client);
            esp_http_client_cleanup(client);
            json = cJSON_Parse(data);
            free(data);
            if (!json || !cJSON_IsArray(json) || cJSON_GetArraySize(json)==0) { ESP_LOGE(TAG, "No releases in list"); cJSON_Delete(json); return ESP_FAIL; }
            for (int i=0; i<cJSON_GetArraySize(json); ++i) {
                cJSON *rel = cJSON_GetArrayItem(json, i);
                cJSON *pre = cJSON_GetObjectItem(rel, "prerelease");
                if (!cJSON_IsTrue(pre)) { release = rel; break; }
            }
        }
    }
    if (!release) { cJSON_Delete(json); ESP_LOGE(TAG, "No suitable release"); (void)ota_persist_state(OTA_STATE_FAILED, ESP_FAIL, repo, NULL, NULL, OTA_REASON_RELEASE_API_FAILURE); return ESP_FAIL; }
    ESP_LOGD(TAG, "Release selected");
    cJSON *assets = cJSON_GetObjectItem(release, "assets");
    if (!cJSON_IsArray(assets)) { cJSON_Delete(json); (void)ota_persist_state(OTA_STATE_FAILED, ESP_FAIL, repo, NULL, NULL, OTA_REASON_MISSING_ASSET); return ESP_FAIL; }
    const char *fw=NULL,*sig=NULL;
    cJSON *tag = cJSON_GetObjectItem(release, "tag_name");
    const char *raw_tag = cJSON_IsString(tag) ? tag->valuestring : NULL;
    int relMaj, relMin, relPat;
    bool relValid = parse_version(cJSON_IsString(tag)?tag->valuestring:NULL, &relMaj, &relMin, &relPat);
    char sanitized_version[INSTALLED_VER_MAX_LEN] = {0};
    if (relValid) {
        snprintf(sanitized_version, sizeof(sanitized_version), "%d.%d.%d",
                 relMaj, relMin, relPat);
        (void)ota_persist_state(OTA_STATE_CHECKING_RELEASE, ESP_OK, repo, sanitized_version, NULL, OTA_REASON_NONE);
    }
    ESP_LOGI(TAG, "Latest release version %d.%d.%d", relMaj, relMin, relPat);
    if (!relValid) {
        ESP_LOGE(TAG, "Invalid release version, assuming 0.0.0");
    }
    int floorMaj, floorMin, floorPat;
    if (relValid && load_rollback_floor(&floorMaj, &floorMin, &floorPat) &&
        cmp_version(relMaj, relMin, relPat, floorMaj, floorMin, floorPat) < 0) {
        ESP_LOGW(TAG, "Refusing release %d.%d.%d below anti-rollback floor %d.%d.%d",
                 relMaj, relMin, relPat, floorMaj, floorMin, floorPat);
        cJSON_Delete(json);
        (void)ota_persist_state(OTA_STATE_FAILED, ESP_FAIL, repo, sanitized_version, NULL,
                                OTA_REASON_ROLLBACK_BLOCKED);
        return ESP_FAIL;
    }
    if (relValid && curValid && cmp_version(relMaj, relMin, relPat, curMaj, curMin, curPat) <= 0) {
        const esp_partition_t *release_partition = find_partition_for_version(relMaj, relMin, relPat);
        const char *version_to_store = sanitized_version[0] ? sanitized_version : raw_tag;

        if (!release_partition) {
            ESP_LOGW(TAG,
                     "Version %d.%d.%d not found in OTA partitions; firmware will be downloaded",
                     relMaj, relMin, relPat);
        } else {
            ESP_LOGI(TAG, "Firmware already up to date on partition %s", release_partition->label);
            if (version_to_store && version_to_store[0] != '\0') {
                esp_err_t store_err = store_installed_version_if_needed(version_to_store,
                                                                        release_partition->label);
                if (store_err != ESP_OK) {
                    ESP_LOGW(TAG, "Unable to refresh stored firmware version: %s",
                             esp_err_to_name(store_err));
                }
            }
            if (update_requested) {
                if (curValid) {
                    ESP_LOGI(TAG, "Update was requested but version %d.%d.%d is already installed",
                             curMaj, curMin, curPat);
                    bool partition_changed = false;
                    esp_err_t boot_err = set_boot_partition_for_installed_firmware(
                            curMaj, curMin, curPat,
                            installed_version[0] != '\0' ? installed_version : version_to_store,
                            &partition_changed);
                    if (boot_err == ESP_OK && partition_changed) {
                        esp_err_t clear_err = write_update_request_flag(false);
                        if (clear_err != ESP_OK) {
                            ESP_LOGW(TAG, "Failed to clear update request flag: %s",
                                     esp_err_to_name(clear_err));
                        }
                        cJSON_Delete(json);
                        ESP_LOGI(TAG, "Rebooting into previously installed firmware");
                        esp_restart();
                        return ESP_OK;
                    } else if (boot_err == ESP_OK) {
                        ESP_LOGI(TAG,
                                 "Boot partition already pointed at installed firmware; "
                                 "skipping reboot");
                    }
                    ESP_LOGE(TAG, "Failed to select installed firmware partition: %s",
                             esp_err_to_name(boot_err));
                    (void)ota_persist_state(OTA_STATE_FAILED, boot_err, repo, version_to_store, NULL,
                                            OTA_REASON_BOOT_PARTITION_SET_FAILURE);
                } else {
                    ESP_LOGW(TAG, "Update was requested but installed version could not be determined");
                }
            }
            cJSON_Delete(json);
            (void)ota_persist_state(OTA_STATE_IDLE, ESP_OK, repo, version_to_store, version_to_store, OTA_REASON_NONE);
            return ESP_OK;
        }
    }
    ESP_LOGD(TAG, "Scanning assets for firmware and signature");
    for (int i=0;i<cJSON_GetArraySize(assets);++i){
        cJSON *a = cJSON_GetArrayItem(assets,i);
        cJSON *name = cJSON_GetObjectItem(a,"name");
        cJSON *url = cJSON_GetObjectItem(a,"browser_download_url");
        if (cJSON_IsString(name) && cJSON_IsString(url)) {
            if (!strcmp(name->valuestring, "main.bin")) fw = url->valuestring;
            else if (!strcmp(name->valuestring, "main.bin.sig")) sig = url->valuestring;
        }
    }
    if (!fw || !sig) { cJSON_Delete(json); ESP_LOGE(TAG, "Missing assets"); (void)ota_persist_state(OTA_STATE_FAILED, ESP_FAIL, repo, sanitized_version, NULL, OTA_REASON_MISSING_ASSET); return ESP_FAIL; }
    ESP_LOGD(TAG, "Firmware URL: %s", fw);
    ESP_LOGD(TAG, "Signature URL: %s", sig);
    ESP_LOGI(TAG, "Release %s selected", cJSON_IsString(tag)?tag->valuestring:"?");
    const char *version_argument = sanitized_version[0] ? sanitized_version : raw_tag;
    esp_err_t res = github_update_from_urls(fw, sig,
                                            version_argument && version_argument[0] ? version_argument : NULL);
    ESP_LOGD(TAG, "github_update_from_urls -> %s", esp_err_to_name(res));
    if (res == ESP_OK) {
        (void)ota_persist_state(OTA_STATE_REBOOTING, ESP_OK, repo, version_argument, version_argument, OTA_REASON_NONE);
    } else {
        (void)ota_persist_state(OTA_STATE_FAILED, res, repo, version_argument, NULL, OTA_REASON_HTTP_FAILURE);
    }
    cJSON_Delete(json);
    return res;
}
